labwork5/src/Documents/Бронь/Бронь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронь</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Экскурсии</name>
    <attributes>
      <name>Экскурсия</name>
      <type>
        <types>CatalogRef.Экскурсии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

labwork5/src/Documents/Бронь/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыЭкскурсии

&НаКлиенте
Процедура ЭкскурсииКоличествоПриИзменении(Элемент)
	ДанныеСтроки = Элементы.Экскурсии.ТекущиеДанные;
	ДанныеСтроки.Цена = ВернутьЦенуЭкскурсии(ДанныеСтроки.Экскурсия)  * ДанныеСтроки.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЭкскурсииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	Объект.ОбщаяСтоимость = Объект.Экскурсии.Итог("Цена");
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьЦенуЭкскурсии(Элемент)
	
	СтоимостьЭкскурсии = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Экскурсии.Цена КАК Цена
		|ИЗ
		|	Справочник.Экскурсии КАК Экскурсии
		|ГДЕ
		|	Экскурсии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Элемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат СтоимостьЭкскурсии; 
	Иначе 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		СтоимостьЭкскурсии = ВыборкаДетальныеЗаписи.Цена;	
		Возврат СтоимостьЭкскурсии;
	КонецЕсли;
	
КонецФункции


#КонецОбласти
